import 'package:cyber_safe/ui/resource/fqa/fqa_model.dart';

List<FQAModel> fqaIn = [
  FQAModel(
    question: "जब मैं अपना पिन भूल जाऊं तो मुझे क्या करना चाहिए?",
    answer:
        "जब आप अपना पिन भूल जाते हैं तो इसे पुनः प्राप्त करने का कोई तरीका नहीं होता क्योंकि आपका पिन आपके डिवाइस के अलावा कहीं भी संग्रहीत नहीं होता है, केवल डेटा मिटाने और ऐप को पुनः सेट करने का विकल्प होता है। कृपया अपने डेटा का नियमित रूप से बैकअप लें ताकि पिन भूलने पर डेटा की हानि से बचा जा सके।",
  ),
  FQAModel(
    question: '"फ़ील्ड जोड़ें" क्या है?',
    answer:
        "जब आप एक खाता बनाते हैं तो फ़ील्ड जोड़ें बटन का उपयोग करके आप कोई भी जानकारी जोड़ सकते हैं जो आप चाहते हैं।",
  ),
  FQAModel(
    question: "बैकअप के बाद डेटा कहां होता है?",
    answer:
        "आपका डेटा आपके डिवाइस पर Download/cyber_safe फोल्डर में बैकअप होता है।",
  ),
  FQAModel(
    question: "जब मैं बैकअप करता हूं तो शेयर पॉपअप क्यों दिखाई देता है?",
    answer:
        "यह सुविधा चाहती है कि आप अपना डेटा विभिन्न स्थानों पर संग्रहीत करें, आप इसे Google Drive और अन्य क्लाउड सेवाओं पर संग्रहीत कर सकते हैं। आपका डेटा एन्क्रिप्टेड है इसलिए निश्चिंत रहें।",
  ),
  FQAModel(question: "बैकअप फ़ाइल का पिन क्या है?", answer: '''
                  यह सुविधा आपके बैकअप फ़ाइल के लिए एक पिन सेट करती है। यह पिन आपके ऐप लॉक पिन के साथ उपयोग होती है, जिससे केवल आप ही बैकअप फ़ाइल का उपयोग कर सकते हैं। अगर फ़ाइल खो जाती है या किसी और के हाथ लग जाती है, तो वे इसे बिना पिन के उपयोग नहीं कर पाएंगे।
  '''),
  FQAModel(question: "स्वचालित लॉगआउट क्या है?", answer: '''
                  यह सुविधा आपको उस समय के बाद स्वचालित रूप से ऐप से लॉगआउट करने में मदद करती है जब आपने ऐप पर कोई गतिविधि नहीं की है। इससे जब आप ऐप का उपयोग नहीं कर रहे होते हैं तो आपकी जानकारी की सुरक्षा होती है।
  '''),
  FQAModel(
      question: "एन्क्रिप्शन की का अपडेट क्या है और यह क्यों महत्वपूर्ण है?",
      answer: '''
                  एन्क्रिप्शन की आपके डेटा को एन्क्रिप्ट करने के लिए उपयोग किए जाने वाले कैरेक्टर की एक स्ट्रिंग है। एक निश्चित समय के बाद हम एक सुरक्षा अपडेट जारी करते हैं जो एन्क्रिप्शन की को बदलता है, जिससे आपके डेटा की सुरक्षा बेहतर होती है। कृपया ध्यान दें कि अपडेट के बाद सभी पुराने बैकअप फ़ाइलें अनुपयोगी हो जाएंगी।
  '''),
  FQAModel(question: "TOTP कोड क्या है?", answer: '''
      TOTP (Time-based One-Time Password) एक समय-आधारित एक बार पासवर्ड है, जो एक निश्चित समय अंतराल के बाद बदलता है। यह कोड उपयोगकर्ता को लॉगिन करते समय प्रमाणित करने के लिए उपयोग किया जाता है। आप QR कोड स्कैन करके या मैन्युअल रूप से दर्ज करके इसे खाता बनाते समय जोड़ सकते हैं।
  '''),
  FQAModel(
      question:
          "मैं ऐप का स्क्रीनशॉट और स्क्रीन रिकॉर्डिंग क्यों नहीं कर सकता?",
      answer: '''
      यह सुविधा आपकी जानकारी की सुरक्षा करती है। जब आप ऐप का स्क्रीनशॉट या स्क्रीन रिकॉर्डिंग नहीं कर सकते, तो यह सुनिश्चित करता है कि आपकी जानकारी लीक नहीं हो और किसी थर्ड-पार्टी ऐप द्वारा चुराई न जाए।
  '''),
  FQAModel(
      question: "अगर मैं ऐप हटा दूं तो क्या मेरा डेटा सुरक्षित रहेगा?",
      answer: '''
      यदि आप ऐप हटाते हैं, तो सभी डेटा पूरी तरह से मिटा दिए जाएंगे। यदि आप फिर से ऐप का उपयोग करना चाहते हैं, तो कृपया ऐप को हटाने से पहले अपने डेटा का बैकअप लें।
  '''),
];
